src/DataProcessors/ИмпортРасходовИзФайла/ИмпортРасходовИзФайла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ИмпортРасходовИзФайла</name>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Documents/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расход</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасхода</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/КатегорииРасходов/КатегорииРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииРасходов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Еда</name>
      <description>Еда</description>
    </items>
    <items>
      <name>Дом</name>
      <description>Дом</description>
    </items>
    <items>
      <name>КоммунальныеУслуги</name>
      <description>Коммунальные услуги</description>
    </items>
    <items>
      <name>Авто</name>
      <description>Авто</description>
    </items>
    <items>
      <name>Транспорт</name>
      <description>Транспорт</description>
    </items>
    <items>
      <name>Банк</name>
      <description>Банк</description>
    </items>
    <items>
      <name>ГаджетыКомпьютеры</name>
      <description>Гаджеты/компьютеры</description>
    </items>
    <items>
      <name>Развлечения</name>
      <description>Развлечения</description>
    </items>
    <items>
      <name>Одежда</name>
      <description>Одежда</description>
    </items>
    <items>
      <name>Здоровье</name>
      <description>Здоровье</description>
    </items>
    <items>
      <name>КрасотаИЗдоровье</name>
      <description>Красота и здоровье</description>
    </items>
    <items>
      <name>Личное</name>
      <description>Личное</description>
    </items>
    <items>
      <name>Отдых</name>
      <description>Отдых</description>
    </items>
    <items>
      <name>Семья</name>
      <description>Семья</description>
    </items>
    <items>
      <name>Спорт</name>
      <description>Спорт</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
    <items>
      <name>НалогиПошлины</name>
      <description>Налоги/пошлины</description>
    </items>
    <items>
      <name>СистемныеКатегории</name>
      <description>Системные категории</description>
    </items>
    <items>
      <name>ПрочиеРасходы</name>
      <description>Прочие расходы</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИконки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВВыборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ИмпортРасходовИзФайла/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма обмена расходами с CSV-файлом (Excel открывает и сохраняет как CSV UTF-8).
// Колонки: Дата; ВидПлатежа; Сумма. UI — HTML в стиле Wallet.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПараметрыПоУмолчанию();
	Протокол = ТекстИнструкцииПоФормату();
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "ВыборДаты" Или ТипЗнч(Параметр) <> Тип("Структура") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если Не Параметр.Свойство("Период") Или Не ЗначениеЗаполнено(Параметр.Период) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если РежимВыбораДатыПериода = "Начало" Тогда
		
		НачалоПериода = НачалоДня(Параметр.Период);
		
		Если КонецПериода < НачалоПериода Тогда
			
			КонецПериода = НачалоПериода;
			
		КонецЕсли;
		
	ИначеЕсли РежимВыбораДатыПериода = "Конец" Тогда
		
		КонецПериода = НачалоДня(Параметр.Период);
		
		Если КонецПериода < НачалоПериода Тогда
			
			НачалоПериода = КонецПериода;
			
		КонецЕсли;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	РежимВыбораДатыПериода = "";
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаПриложения = ИзвлечьКомандуИзСсылки(ДанныеСобытия.Href);
	
	Если Не ЗначениеЗаполнено(КомандаПриложения) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если КомандаПриложения = "close" Тогда
		
		Закрыть();
		
	ИначеЕсли КомандаПриложения = "pick-account" Тогда
		
		НачатьВыборСчета();
		
	ИначеЕсли КомандаПриложения = "pick-currency" Тогда
		
		НачатьВыборВалюты();
		
	ИначеЕсли КомандаПриложения = "pick-date-from" Тогда
		
		ОткрытьВыборДатыПериода("Начало");
		
	ИначеЕсли КомандаПриложения = "pick-date-to" Тогда
		
		ОткрытьВыборДатыПериода("Конец");
		
	ИначеЕсли КомандаПриложения = "import" Тогда
		
		ВыбратьФайлИЗагрузить();
		
	ИначеЕсли КомандаПриложения = "export" Тогда
		
		ВыгрузитьВФайл();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьHTMLНаСервере()
	
	ТекстHTML = СобратьHTMLЭкранаОбмена();
	
КонецПроцедуры

&НаСервере
Функция СобратьHTMLЭкранаОбмена()
	
	СчетТекст = ?(ЗначениеЗаполнено(Объект.Счет), Строка(Объект.Счет), "Не выбран");
	ВалютаТекст = ?(ЗначениеЗаполнено(Объект.Валюта), Строка(Объект.Валюта), "Не выбрана");
	НачалоТекст = ?(ЗначениеЗаполнено(НачалоПериода), Формат(НачалоПериода, "ДФ=dd.MM.yyyy"), "—");
	КонецТекст = ?(ЗначениеЗаполнено(КонецПериода), Формат(КонецПериода, "ДФ=dd.MM.yyyy"), "—");
	ПротоколHTML = СтрЗаменить(ЭкранироватьHTML(Протокол), Символы.ПС, "<br>");
	
	Строки = Новый Массив;
	Строки.Добавить("<!DOCTYPE html><html lang=""ru""><head><meta charset=""utf-8"">");
	Строки.Добавить("<meta name=""viewport"" content=""width=device-width, initial-scale=1, maximum-scale=1"">");
	Строки.Добавить("<style>");
	Строки.Добавить("body{font-family:-apple-system,BlinkMacSystemFont,Segoe UI,Roboto,sans-serif;margin:0;padding:16px;background:#FAFAFA;color:#111827}");
	Строки.Добавить("h1{font-size:22px;font-weight:700;margin:0 0 6px;letter-spacing:-0.02em}");
	Строки.Добавить(".sub{font-size:13px;color:#6B7280;margin:0 0 14px;line-height:1.35}");
	Строки.Добавить(".card{background:#fff;border:1px solid #E5E7EB;border-radius:16px;padding:4px 14px;margin-bottom:12px}");
	Строки.Добавить("a.row{display:flex;justify-content:space-between;align-items:center;gap:10px;padding:14px 0;border-top:1px solid #F3F4F6;text-decoration:none;color:inherit}");
	Строки.Добавить("a.row:first-child{border-top:none}");
	Строки.Добавить(".lbl{color:#6B7280;font-size:13px;flex-shrink:0}");
	Строки.Добавить(".val{font-size:15px;font-weight:600;text-align:right;color:#111827}");
	Строки.Добавить(".chev{color:#C0C7D1;margin-left:6px;font-weight:400}");
	Строки.Добавить(".btn{display:block;text-decoration:none;text-align:center;border-radius:12px;padding:14px;margin:8px 0;font-weight:600;font-size:15px}");
	Строки.Добавить(".btn.primary{background:#2563EB;color:#fff}");
	Строки.Добавить(".btn.secondary{background:#EFF6FF;color:#1D4ED8}");
	Строки.Добавить(".btn.muted{background:#F3F4F6;color:#374151}");
	Строки.Добавить(".proto{background:#fff;border:1px solid #E5E7EB;border-radius:16px;padding:12px 14px;font-size:13px;color:#374151;line-height:1.45;margin-bottom:12px}");
	Строки.Добавить(".hint{font-size:12px;color:#6B7280;margin:4px 0 10px;line-height:1.4}");
	Строки.Добавить("</style></head><body>");
	Строки.Добавить("<h1>Обмен расходами</h1>");
	Строки.Добавить("<div class=""sub"">CSV UTF-8 для Excel — загрузка и выгрузка</div>");
	Строки.Добавить("<div class=""card"">");
	Строки.Добавить("<a class=""row"" href=""app:pick-account""><span class=""lbl"">Счёт</span><span class=""val"">"
		+ ЭкранироватьHTML(СчетТекст) + "<span class=""chev"">›</span></span></a>");
	Строки.Добавить("<a class=""row"" href=""app:pick-currency""><span class=""lbl"">Валюта</span><span class=""val"">"
		+ ЭкранироватьHTML(ВалютаТекст) + "<span class=""chev"">›</span></span></a>");
	Строки.Добавить("<a class=""row"" href=""app:pick-date-from""><span class=""lbl"">Период с</span><span class=""val"">"
		+ ЭкранироватьHTML(НачалоТекст) + "<span class=""chev"">›</span></span></a>");
	Строки.Добавить("<a class=""row"" href=""app:pick-date-to""><span class=""lbl"">Период по</span><span class=""val"">"
		+ ЭкранироватьHTML(КонецТекст) + "<span class=""chev"">›</span></span></a>");
	Строки.Добавить("</div>");
	Строки.Добавить("<a class=""btn primary"" href=""app:import"">Загрузить из файла</a>");
	Строки.Добавить("<div class=""hint"">Нужны счёт и валюта. Файл: Дата, ВидПлатежа, Сумма.</div>");
	Строки.Добавить("<a class=""btn secondary"" href=""app:export"">Выгрузить в файл</a>");
	Строки.Добавить("<div class=""hint"">Выгрузка по выбранному периоду в каталог документов.</div>");
	Строки.Добавить("<div class=""proto"">" + ПротоколHTML + "</div>");
	Строки.Добавить("<a class=""btn muted"" href=""app:close"">Закрыть</a>");
	Строки.Добавить("</body></html>");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

&НаСервере
Функция ЭкранироватьHTML(Текст)
	
	Результат = Строка(Текст);
	Результат = СтрЗаменить(Результат, "&", "&amp;");
	Результат = СтрЗаменить(Результат, "<", "&lt;");
	Результат = СтрЗаменить(Результат, ">", "&gt;");
	Результат = СтрЗаменить(Результат, """", "&quot;");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ИзвлечьКомандуИзСсылки(Знач Href)
	
	Если Не ЗначениеЗаполнено(Href) Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Маркер = "app:";
	Позиция = СтрНайти(Href, Маркер);
	
	Если Позиция = 0 Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Команда = Сред(Href, Позиция + СтрДлина(Маркер));
	ПозицияПараметров = СтрНайти(Команда, "?");
	
	Если ПозицияПараметров > 0 Тогда
		
		Команда = Лев(Команда, ПозицияПараметров - 1);
		
	КонецЕсли;
	
	ПозицияЯкоря = СтрНайти(Команда, "#");
	
	Если ПозицияЯкоря > 0 Тогда
		
		Команда = Лев(Команда, ПозицияЯкоря - 1);
		
	КонецЕсли;
	
	Возврат Команда;
	
КонецФункции

&НаКлиенте
Процедура НачатьВыборСчета()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСчета", ЭтотОбъект);
	ОбщийМодульКлиент.ПоказатьВыборСчета(ОписаниеОповещения, Объект.Счет, "Счёт для расходов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСчета(ВыбранныйСчет, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйСчет = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Счет = ВыбранныйСчет;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыборВалюты()
	
	СписокВалют = СписокВалютДляВыбораНаСервере();
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораВалютыИзСписка", ЭтотОбъект);
	ПоказатьВыборИзСписка(ОписаниеОповещения, СписокВалют, , Объект.Валюта);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВалютыИзСписка(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.Валюта = ВыбранныйЭлемент.Значение;
	ОбновитьHTMLНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокВалютДляВыбораНаСервере()
	
	Список = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Валюта.Ссылка КАК Ссылка,
	|	Валюта.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Валюта КАК Валюта
	|ГДЕ
	|	НЕ Валюта.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Список.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьВыборДатыПериода(РежимВыбора)
	
	РежимВыбораДатыПериода = РежимВыбора;
	ПараметрыКалендаря = Новый Структура;
	ПараметрыКалендаря.Вставить("ТолькоДата", Истина);
	ПараметрыКалендаря.Вставить("Дата", ?(РежимВыбора = "Начало", НачалоПериода, КонецПериода));
	ОткрытьФорму("ОбщаяФорма.ФормаКалендаря", ПараметрыКалендаря, ЭтотОбъект, , , , ,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлИЗагрузить()
	
	Если Не ЗначениеЗаполнено(Объект.Счет) Тогда
		
		ПоказатьПредупреждение(, "Укажите счёт, на который будут записаны расходы.");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		ПоказатьПредупреждение(, "Укажите валюту операций.");
		Возврат;
		
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайлаИмпорта", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайлаИмпорта(РезультатВыбора, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВыбора Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Результат = ЗагрузитьИзХранилищаНаСервере(Адрес, ВыбранноеИмяФайла);
	Протокол = Результат.Протокол;
	ОбновитьHTMLНаСервере();
	ПоказатьПредупреждение(, Результат.КраткийТекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайл()
	
	Результат = СформироватьВыгрузкуНаСервере();
	
	Если Не Результат.Успех Тогда
		
		Протокол = Результат.Протокол;
		ОбновитьHTMLНаСервере();
		ПоказатьПредупреждение(, Результат.КраткийТекст);
		Возврат;
		
	КонецЕсли;
	
	ПутьКФайлу = ПолныйПутьФайлаВКаталоге(КаталогДокументов(), Результат.ИмяФайла);
	
	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(Результат.ТекстCSV);
	ЗаписьТекста.Закрыть();
	
	Протокол = Результат.Протокол + Символы.ПС + Символы.ПС + "Файл сохранён:" + Символы.ПС + ПутьКФайлу
		+ Символы.ПС + "Откройте его в Excel или передайте другому устройству.";
	ОбновитьHTMLНаСервере();
	ПоказатьПредупреждение(, Результат.КраткийТекст + Символы.ПС + ПутьКФайлу);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметрыПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		Объект.Валюта = Константы.ВалютаУчета.Получить();
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		
		НачалоПериода = НачалоГода(ТекущаяДатаСеанса());
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		
		КонецПериода = КонецДня(ТекущаяДатаСеанса());
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Счет) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Счета.Ссылка КАК Счет
	|ИЗ
	|	Справочник.Счета КАК Счета
	|ГДЕ
	|	НЕ Счета.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Счета.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Объект.Счет = Выборка.Счет;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолныйПутьФайлаВКаталоге(Каталог, ИмяФайла)
	
	ПутьКаталога = СокрЛП(Каталог);
	Разделитель = ПолучитьРазделительПути();
	
	Если Прав(ПутьКаталога, 1) <> "/" И Прав(ПутьКаталога, 1) <> "\" Тогда
		
		ПутьКаталога = ПутьКаталога + Разделитель;
		
	КонецЕсли;
	
	Возврат ПутьКаталога + ИмяФайла;
	
КонецФункции

&НаСервере
Функция СформироватьВыгрузкуНаСервере()
	
	Результат = Новый Структура("Успех, КраткийТекст, Протокол, ТекстCSV, ИмяФайла", Ложь, "", "", "", "");
	
	ДатаНачала = ?(ЗначениеЗаполнено(НачалоПериода), НачалоДня(НачалоПериода), '00010101');
	ДатаКонца = ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), '39991231235959');
	
	Если ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода) И НачалоПериода > КонецПериода Тогда
		
		Результат.КраткийТекст = "Начало периода больше конца периода.";
		Результат.Протокол = Результат.КраткийТекст;
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Расход.Дата КАК Дата,
	|	Расход.КатегорияРасхода КАК КатегорияРасхода,
	|	Расход.КатегорияРасхода.Наименование КАК КатегорияНаименование,
	|	Расход.КатегорияРасхода.Родитель КАК КатегорияРодитель,
	|	Расход.Комментарий КАК Комментарий,
	|	Расход.Сумма КАК Сумма
	|ИЗ
	|	Документ.Расход КАК Расход
	|ГДЕ
	|	Расход.Проведен
	|	И НЕ Расход.ПометкаУдаления
	|	И Расход.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	Расход.Дата,
	|	Расход.Номер";
	Запрос.УстановитьПараметр("НачалоПериода", ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ДатаКонца);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ГруппаПрочее = Справочники.КатегорииРасходов.Прочее;
	КатегорияПрочие = Справочники.КатегорииРасходов.ПрочиеРасходы;
	
	СтрокиCSV = Новый Массив;
	СтрокиCSV.Добавить(Символ(65279) + "Дата,ВидПлатежа,Сумма");
	КоличествоСтрок = 0;
	
	Пока Выборка.Следующий() Цикл
		
		ВидПлатежа = ВидПлатежаДляВыгрузки(Выборка.КатегорияРасхода, Выборка.КатегорияНаименование,
			Выборка.КатегорияРодитель, Выборка.Комментарий, ГруппаПрочее, КатегорияПрочие);
		СтрокиCSV.Добавить(СтрШаблон("%1,%2,%3",
			Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"),
			ЭкранироватьПолеCSV(ВидПлатежа),
			ФорматСуммыДляCSV(Выборка.Сумма)));
		КоличествоСтрок = КоличествоСтрок + 1;
		
	КонецЦикла;
	
	Результат.ТекстCSV = СтрСоединить(СтрокиCSV, Символы.ПС);
	Результат.ИмяФайла = СтрШаблон("Wallet_расходы_%1.csv", Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMdd_HHmmss"));
	Результат.Успех = Истина;
	Результат.КраткийТекст = СтрШаблон("Выгружено строк: %1.", Формат(КоличествоСтрок, "ЧГ=0"));
	Результат.Протокол = Результат.КраткийТекст + Символы.ПС
		+ "Период: " + Формат(ДатаНачала, "ДФ=dd.MM.yyyy; ДП=—") + " — " + Формат(ДатаКонца, "ДФ=dd.MM.yyyy; ДП=—")
		+ Символы.ПС + "Формат: CSV UTF-8, разделитель «,» (как в Excel «Сохранить как»).";
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВидПлатежаДляВыгрузки(Категория, КатегорияНаименование, КатегорияРодитель, Комментарий, ГруппаПрочее, КатегорияПрочие)
	
	ТекстКомментария = СокрЛП(Комментарий);
	
	Если Категория = КатегорияПрочие Тогда
		
		Если ЗначениеЗаполнено(ТекстКомментария) Тогда
			
			Возврат "Разное (" + ТекстКомментария + ")";
			
		КонецЕсли;
		
		Возврат "Разное";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаПрочее) И КатегорияРодитель = ГруппаПрочее Тогда
		
		Возврат "Разное (" + СокрЛП(КатегорияНаименование) + ")";
		
	КонецЕсли;
	
	Возврат СокрЛП(КатегорияНаименование);
	
КонецФункции

&НаСервереБезКонтекста
Функция ФорматСуммыДляCSV(Сумма)
	
	// Точка как десятичный разделитель — без конфликта с «,» в CSV Excel.
	Возврат Формат(Сумма, "ЧДЦ=2; ЧРД=.; ЧГ=0; ЧН=0.00");
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭкранироватьПолеCSV(Значение)
	
	Текст = Строка(Значение);
	
	Если СтрНайти(Текст, ",") > 0 Или СтрНайти(Текст, ";") > 0
		Или СтрНайти(Текст, """") > 0 Или СтрНайти(Текст, Символы.ПС) > 0 Тогда
		
		Текст = СтрЗаменить(Текст, """", """""");
		Возврат """" + Текст + """";
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ЗагрузитьИзХранилищаНаСервере(АдресВХранилище, ИмяФайла)
	
	Результат = Новый Структура("Успех, КраткийТекст, Протокол", Ложь, "", "");
	СтрокиПротокола = Новый Массив;
	СтрокиПротокола.Добавить("Файл: " + Строка(ИмяФайла));
	СтрокиПротокола.Добавить("");
	
	Если Не ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		
		Результат.КраткийТекст = "Не удалось получить файл.";
		Результат.Протокол = Результат.КраткийТекст;
		Возврат Результат;
		
	КонецЕсли;
	
	Данные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Если ТипЗнч(Данные) <> Тип("ДвоичныеДанные") Тогда
		
		Результат.КраткийТекст = "Неподдерживаемый тип данных файла.";
		Результат.Протокол = Результат.КраткийТекст;
		Возврат Результат;
		
	КонецЕсли;
	
	Если ЭтоФайлExcelПоИмени(ИмяФайла) Или ЭтоБинарныйExcel(Данные) Тогда
		
		Результат.КраткийТекст = "Выбран файл Excel (.xls/.xlsx). Сохраните его как CSV (UTF-8) и повторите загрузку.";
		Результат.Протокол = Результат.КраткийТекст + Символы.ПС + Символы.ПС + ТекстИнструкцииПоФормату();
		Возврат Результат;
		
	КонецЕсли;
	
	ТекстФайла = ПолучитьСтрокуИзДвоичныхДанных(Данные, КодировкаТекста.UTF8);
	ТекстФайла = УбратьBOM(ТекстФайла);
	
	Если Не ЗначениеЗаполнено(СокрЛП(ТекстФайла)) Тогда
		
		Результат.КраткийТекст = "Файл пустой.";
		Результат.Протокол = Результат.КраткийТекст;
		Возврат Результат;
		
	КонецЕсли;
	
	ТаблицаСтрок = РазобратьТекстCSV(ТекстФайла);
	
	Если ТаблицаСтрок.Количество() = 0 Тогда
		
		Результат.КраткийТекст = "В файле не найдено строк с данными.";
		Результат.Протокол = Результат.КраткийТекст + Символы.ПС + Символы.ПС + ТекстИнструкцииПоФормату();
		Возврат Результат;
		
	КонецЕсли;
	
	КэшКатегорий = КэшКатегорийРасходов();
	КатегорияПрочие = Справочники.КатегорииРасходов.ПрочиеРасходы;
	
	Загружено = 0;
	Пропущено = 0;
	
	Для Каждого СтрокаДанных Из ТаблицаСтрок Цикл
		
		ОписаниеОшибки = "";
		ДокументСоздан = СоздатьДокументРасхода(СтрокаДанных, Объект.Счет, Объект.Валюта, КэшКатегорий, КатегорияПрочие, ОписаниеОшибки);
		
		Если ДокументСоздан Тогда
			
			Загружено = Загружено + 1;
			
		Иначе
			
			Пропущено = Пропущено + 1;
			СтрокиПротокола.Добавить(СтрШаблон("Строка %1: %2", Формат(СтрокаДанных.НомерСтроки, "ЧГ=0"), ОписаниеОшибки));
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтрокиПротокола.Вставить(1, СтрШаблон("Загружено: %1, пропущено: %2 из %3.",
		Формат(Загружено, "ЧГ=0"), Формат(Пропущено, "ЧГ=0"), Формат(ТаблицаСтрок.Количество(), "ЧГ=0")));
	
	Результат.Успех = Загружено > 0;
	Результат.КраткийТекст = СтрШаблон("Импорт завершён. Загружено: %1, пропущено: %2.",
		Формат(Загружено, "ЧГ=0"), Формат(Пропущено, "ЧГ=0"));
	Результат.Протокол = СтрСоединить(СтрокиПротокола, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоФайлExcelПоИмени(ИмяФайла)
	
	ИмяНижний = НРег(Строка(ИмяФайла));
	
	Возврат СтрЗаканчиваетсяНа(ИмяНижний, ".xlsx")
		Или СтрЗаканчиваетсяНа(ИмяНижний, ".xls")
		Или СтрЗаканчиваетсяНа(ИмяНижний, ".xlsm");
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоБинарныйExcel(ДвоичныеДанные)
	
	Если ДвоичныеДанные.Размер() < 4 Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	// Сигнатуры ZIP (xlsx) и OLE Compound (xls) в Base64.
	НачалоBase64 = Лев(Base64Строка(ДвоичныеДанные), 8);
	
	Если СтрНачинаетсяС(НачалоBase64, "UEs") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Если СтрНачинаетсяС(НачалоBase64, "0M8R4") Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция УбратьBOM(Текст)
	
	Если СтрДлина(Текст) > 0 И КодСимвола(Текст, 1) = 65279 Тогда
		
		Возврат Сред(Текст, 2);
		
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ТекстИнструкцииПоФормату()
	
	Строки = Новый Массив;
	Строки.Добавить("Обмен с Excel: CSV UTF-8 (разделитель «,» — как в «Сохранить как»).");
	Строки.Добавить("Excel: Сохранить как → CSV UTF-8 (разделитель — запятая).");
	Строки.Добавить("Точка с запятой «;» тоже поддерживается.");
	Строки.Добавить("");
	Строки.Добавить("Колонки: Дата, ВидПлатежа, Сумма");
	Строки.Добавить("  Дата — ДД.ММ.ГГГГ");
	Строки.Добавить("  ВидПлатежа — Обед, Разное (такси), …");
	Строки.Добавить("  Сумма — 1234.56 или 1 234,56 (в кавычках)");
	Строки.Добавить("");
	Строки.Добавить("Загрузка: счёт + валюта → «Загрузить из файла».");
	Строки.Добавить("Выгрузка: период → «Выгрузить в файл».");
	
	Возврат СтрСоединить(Строки, Символы.ПС);
	
КонецФункции

&НаСервереБезКонтекста
Функция РазобратьТекстCSV(ТекстФайла)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("НомерСтроки");
	Таблица.Колонки.Добавить("Дата");
	Таблица.Колонки.Добавить("ВидПлатежа");
	Таблица.Колонки.Добавить("Сумма");
	Таблица.Колонки.Добавить("Комментарий");
	
	Нормализованный = СтрЗаменить(ТекстФайла, Символы.ВК, "");
	СтрокиФайла = СтрРазделить(Нормализованный, Символы.ПС, Ложь);
	
	Если СтрокиФайла.Количество() = 0 Тогда
		
		Возврат Таблица;
		
	КонецЕсли;
	
	Разделитель = ОпределитьРазделитель(СтрокиФайла[0]);
	Индексы = ОпределитьИндексыКолонок(СтрокиФайла[0], Разделитель);
	НомерПервойСтрокиДанных = ?(Индексы.ЕстьЗаголовок, 1, 0);
	
	Для Индекс = НомерПервойСтрокиДанных По СтрокиФайла.ВГраница() Цикл
		
		ТекстСтроки = СокрЛП(СтрокиФайла[Индекс]);
		
		Если Не ЗначениеЗаполнено(ТекстСтроки) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Поля = РазделитьСтрокуCSV(ТекстСтроки, Разделитель);
		НомерСтрокиФайла = Индекс + 1;
		
		ТекстДаты = ЗначениеПоля(Поля, Индексы.Дата);
		ТекстВида = ЗначениеПоля(Поля, Индексы.ВидПлатежа);
		ТекстСуммы = ЗначениеПоля(Поля, Индексы.Сумма);
		
		Если Не ЗначениеЗаполнено(ТекстДаты) И Не ЗначениеЗаполнено(ТекстВида) И Не ЗначениеЗаполнено(ТекстСуммы) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.НомерСтроки = НомерСтрокиФайла;
		НоваяСтрока.Дата = РазобратьДату(ТекстДаты);
		НоваяСтрока.ВидПлатежа = СокрЛП(ТекстВида);
		НоваяСтрока.Сумма = РазобратьСумму(ТекстСуммы);
		НоваяСтрока.Комментарий = "";
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьРазделитель(ПерваяСтрока)
	
	// Для заголовка Excel «Дата,ВидПлатежа,Сумма» важны именно разделители полей.
	ПоляТочкаСЗапятой = РазделитьСтрокуCSV(ПерваяСтрока, ";");
	ПоляЗапятая = РазделитьСтрокуCSV(ПерваяСтрока, ",");
	ПоляТаб = РазделитьСтрокуCSV(ПерваяСтрока, Символы.Таб);
	
	Если ПоляЗапятая.Количество() >= 3 Тогда
		
		Возврат ",";
		
	КонецЕсли;
	
	Если ПоляТочкаСЗапятой.Количество() >= 3 Тогда
		
		Возврат ";";
		
	КонецЕсли;
	
	Если ПоляТаб.Количество() >= 3 Тогда
		
		Возврат Символы.Таб;
		
	КонецЕсли;
	
	Если ПоляЗапятая.Количество() > ПоляТочкаСЗапятой.Количество() Тогда
		
		Возврат ",";
		
	КонецЕсли;
	
	Если ПоляТочкаСЗапятой.Количество() > 1 Тогда
		
		Возврат ";";
		
	КонецЕсли;
	
	Возврат ",";
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьИндексыКолонок(ПерваяСтрока, Разделитель)
	
	Результат = Новый Структура("ЕстьЗаголовок, Дата, ВидПлатежа, Сумма", Ложь, 0, 1, 2);
	Поля = РазделитьСтрокуCSV(НРег(СокрЛП(ПерваяСтрока)), Разделитель);
	
	ИндексДаты = -1;
	ИндексВида = -1;
	ИндексСуммы = -1;
	
	Для Индекс = 0 По Поля.ВГраница() Цикл
		
		Имя = СокрЛП(Поля[Индекс]);
		Имя = СтрЗаменить(Имя, """", "");
		
		Если Имя = "дата" Или Имя = "date" Тогда
			
			ИндексДаты = Индекс;
			
		ИначеЕсли Имя = "видплатежа" Или Имя = "вид платежа" Или Имя = "категория" Или Имя = "category" Тогда
			
			ИндексВида = Индекс;
			
		ИначеЕсли Имя = "сумма" Или Имя = "amount" Или Имя = "sum" Тогда
			
			ИндексСуммы = Индекс;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ИндексДаты >= 0 Или ИндексВида >= 0 Или ИндексСуммы >= 0 Тогда
		
		Результат.ЕстьЗаголовок = Истина;
		
		Если ИндексДаты >= 0 Тогда
			
			Результат.Дата = ИндексДаты;
			
		КонецЕсли;
		
		Если ИндексВида >= 0 Тогда
			
			Результат.ВидПлатежа = ИндексВида;
			
		КонецЕсли;
		
		Если ИндексСуммы >= 0 Тогда
			
			Результат.Сумма = ИндексСуммы;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Разбивает строку CSV с учётом кавычек (сумма «1 234,56» не режется по запятой).
//
&НаСервереБезКонтекста
Функция РазделитьСтрокуCSV(ТекстСтроки, Разделитель)
	
	Поля = Новый Массив;
	ТекущееПоле = "";
	ВКавычках = Ложь;
	Длина = СтрДлина(ТекстСтроки);
	Индекс = 1;
	
	Пока Индекс <= Длина Цикл
		
		Символ = Сред(ТекстСтроки, Индекс, 1);
		
		Если Символ = """" Тогда
			
			Если ВКавычках И Индекс < Длина И Сред(ТекстСтроки, Индекс + 1, 1) = """" Тогда
				
				ТекущееПоле = ТекущееПоле + """";
				Индекс = Индекс + 2;
				Продолжить;
				
			КонецЕсли;
			
			ВКавычках = Не ВКавычках;
			Индекс = Индекс + 1;
			Продолжить;
			
		КонецЕсли;
		
		Если Не ВКавычках И Символ = Разделитель Тогда
			
			Поля.Добавить(ТекущееПоле);
			ТекущееПоле = "";
			Индекс = Индекс + 1;
			Продолжить;
			
		КонецЕсли;
		
		ТекущееПоле = ТекущееПоле + Символ;
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Поля.Добавить(ТекущееПоле);
	
	Возврат Поля;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеПоля(Поля, Индекс)
	
	Если Индекс < 0 Или Индекс > Поля.ВГраница() Тогда
		
		Возврат "";
		
	КонецЕсли;
	
	Значение = СокрЛП(Поля[Индекс]);
	
	Если СтрДлина(Значение) >= 2 И Лев(Значение, 1) = """" И Прав(Значение, 1) = """" Тогда
		
		Значение = Сред(Значение, 2, СтрДлина(Значение) - 2);
		
	КонецЕсли;
	
	Возврат СокрЛП(Значение);
	
КонецФункции

&НаСервереБезКонтекста
Функция РазобратьДату(ТекстДаты)
	
	Текст = СокрЛП(ТекстДаты);
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		
		Возврат '00010101';
		
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, "/", ".");
	Текст = СтрЗаменить(Текст, "-", ".");
	Части = СтрРазделить(Текст, ".", Ложь);
	
	Если Части.Количество() <> 3 Тогда
		
		Возврат '00010101';
		
	КонецЕсли;
	
	День = ЧислоИзСтрокиБезопасно(Части[0]);
	Месяц = ЧислоИзСтрокиБезопасно(Части[1]);
	Год = ЧислоИзСтрокиБезопасно(Части[2]);
	
	Если Год < 100 Тогда
		
		Год = 2000 + Год;
		
	КонецЕсли;
	
	Если День < 1 Или День > 31 Или Месяц < 1 Или Месяц > 12 Или Год < 1900 Тогда
		
		Возврат '00010101';
		
	КонецЕсли;
	
	Попытка
		
		Возврат Дата(Год, Месяц, День);
		
	Исключение
		
		Возврат '00010101';
		
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазобратьСумму(ТекстСуммы)
	
	Текст = СокрЛП(ТекстСуммы);
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	Текст = СтрЗаменить(Текст, Символы.НПП, "");
	Текст = СтрЗаменить(Текст, " ", "");
	Текст = СтрЗаменить(Текст, """", "");
	Текст = СтрЗаменить(Текст, "'", "");
	
	Если СтрНайти(Текст, ",") > 0 И СтрНайти(Текст, ".") > 0 Тогда
		
		Текст = СтрЗаменить(Текст, ".", "");
		Текст = СтрЗаменить(Текст, ",", ".");
		
	Иначе
		
		Текст = СтрЗаменить(Текст, ",", ".");
		
	КонецЕсли;
	
	Возврат ЧислоИзСтрокиБезопасно(Текст);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЧислоИзСтрокиБезопасно(Текст)
	
	Попытка
		
		Возврат Число(Текст);
		
	Исключение
		
		Возврат 0;
		
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция КэшКатегорийРасходов()
	
	Кэш = Новый Структура;
	Кэш.Вставить("ПоИмени", Новый Соответствие);
	Кэш.Вставить("ПоИмениВПрочем", Новый Соответствие);
	Кэш.Вставить("Список", Новый Массив);
	Кэш.Вставить("Синонимы", СинонимыВидовПлатежа());
	Кэш.Вставить("ГруппаПрочее", Справочники.КатегорииРасходов.Прочее);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Категории.Ссылка КАК Ссылка,
	|	Категории.Наименование КАК Наименование,
	|	Категории.Родитель КАК Родитель
	|ИЗ
	|	Справочник.КатегорииРасходов КАК Категории
	|ГДЕ
	|	НЕ Категории.ЭтоГруппа
	|	И НЕ Категории.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ключ = НРег(СокрЛП(Выборка.Наименование));
		Кэш.ПоИмени.Вставить(Ключ, Выборка.Ссылка);
		
		Элемент = Новый Структура("Ссылка, Наименование, Ключ", Выборка.Ссылка, Выборка.Наименование, Ключ);
		Кэш.Список.Добавить(Элемент);
		
		Если ЗначениеЗаполнено(Кэш.ГруппаПрочее) И Выборка.Родитель = Кэш.ГруппаПрочее Тогда
			
			Кэш.ПоИмениВПрочем.Вставить(Ключ, Выборка.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Кэш;
	
КонецФункции

// Словарь частых формулировок Excel → наименование категории в справочнике.
//
&НаСервереБезКонтекста
Функция СинонимыВидовПлатежа()
	
	Синонимы = Новый Соответствие;
	Синонимы.Вставить("бензин", "Топливо");
	Синонимы.Вставить("аренда квартиры", "Аренда");
	Синонимы.Вставить("интернет дома", "Интернет дом./моб.");
	Синонимы.Вставить("казахтелеком интернет", "Интернет дом./моб.");
	Синонимы.Вставить("баланс на телефон", "Мобильная связь");
	Синонимы.Вставить("комиссия за перевод", "Комиссия");
	Синонимы.Вставить("коммиссия за перевод", "Комиссия");
	Синонимы.Вставить("ужин", "Кафе");
	Синонимы.Вставить("тренировки", "Тренажерный зал");
	Синонимы.Вставить("тренеру за трени", "Тренажерный зал");
	Синонимы.Вставить("трениеру за трени", "Тренажерный зал");
	Синонимы.Вставить("ремонт мазды", "Ремонт/запчасти");
	Синонимы.Вставить("ремонт (мазда)", "Ремонт/запчасти");
	Синонимы.Вставить("замена стартера", "Ремонт/запчасти");
	Синонимы.Вставить("стеклоомывающая жидкость", "Топливо");
	Синонимы.Вставить("парикмахерская", "Стрижка");
	Синонимы.Вставить("стоматолог", "Зубы");
	Синонимы.Вставить("лекарства", "Лекарства");
	Синонимы.Вставить("кино", "Кино");
	Синонимы.Вставить("билеты в кино", "Кино");
	Синонимы.Вставить("концерты", "Концерт");
	Синонимы.Вставить("билеты на концерт", "Концерт");
	Синонимы.Вставить("авиабилеты", "Самолет");
	Синонимы.Вставить("билеты жд", "Поезд");
	Синонимы.Вставить("метро", "Общественный транспорт");
	Синонимы.Вставить("карта онай", "Общественный транспорт");
	Синонимы.Вставить("яндекс", "Такси");
	Синонимы.Вставить("доставка еды", "Кафе");
	Синонимы.Вставить("обувь", "Обувь");
	Синонимы.Вставить("кросовки", "Обувь");
	Синонимы.Вставить("одежда", "Одежда верхняя");
	Синонимы.Вставить("книги", "Книги");
	Синонимы.Вставить("книга", "Книги");
	Синонимы.Вставить("подарки", "Подарки");
	Синонимы.Вставить("мойка", "Обслуживание");
	Синонимы.Вставить("техосмотр", "Обслуживание");
	Синонимы.Вставить("тех осмотр", "Обслуживание");
	Синонимы.Вставить("налог на транспорт", "Налоги/пошлины");
	Синонимы.Вставить("налог на машину", "Налоги/пошлины");
	Синонимы.Вставить("налог на имущество", "Налоги/пошлины");
	Синонимы.Вставить("коммунальные услуги", "Электр./вода/газ");
	Синонимы.Вставить("правильное питание", "Продукты");
	Синонимы.Вставить("покупка пп", "Продукты");
	
	Возврат Синонимы;
	
КонецФункции

&НаСервереБезКонтекста
Функция СоздатьДокументРасхода(СтрокаДанных, Счет, Валюта, КэшКатегорий, КатегорияПрочие, ОписаниеОшибки)
	
	Если Не ЗначениеЗаполнено(СтрокаДанных.Дата) Тогда
		
		ОписаниеОшибки = "не удалось разобрать дату.";
		Возврат Ложь;
		
	КонецЕсли;
	
	Если СтрокаДанных.Сумма <= 0 Тогда
		
		ОписаниеОшибки = "сумма должна быть больше нуля.";
		Возврат Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаДанных.ВидПлатежа) Тогда
		
		ОписаниеОшибки = "не указан вид платежа.";
		Возврат Ложь;
		
	КонецЕсли;
	
	РезультатКатегории = НайтиКатегориюПоВидуПлатежа(СтрокаДанных.ВидПлатежа, КэшКатегорий, КатегорияПрочие);
	
	ДокументОбъект = Документы.Расход.СоздатьДокумент();
	ДокументОбъект.Дата = СтрокаДанных.Дата;
	ДокументОбъект.Счет = Счет;
	ДокументОбъект.Валюта = Валюта;
	ДокументОбъект.КатегорияРасхода = РезультатКатегории.Категория;
	ДокументОбъект.Сумма = СтрокаДанных.Сумма;
	ДокументОбъект.Комментарий = ОбрезатьКомментарий(РезультатКатегории.Комментарий);
	
	// Ошибки проведения по строкам импорта не должны останавливать весь файл.
	Попытка
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКатегориюПоВидуПлатежа(ВидПлатежа, КэшКатегорий, КатегорияПрочие)
	
	Результат = Новый Структура("Категория, Комментарий", КатегорияПрочие, "");
	Текст = СокрЛП(ВидПлатежа);
	База = Текст;
	Уточнение = "";
	
	РазобратьБазуИУточнение(Текст, База, Уточнение);
	
	// «Разное (…)» / «Прочее (…)» — сначала ищем категорию из скобок в папке «Прочее».
	Если ЭтоБазаПрочее(База) Тогда
		
		Если ЗначениеЗаполнено(Уточнение) Тогда
			
			Категория = НайтиВПапкеПрочее(КэшКатегорий, Уточнение);
			
			Если Не ЗначениеЗаполнено(Категория) Тогда
				
				Категория = НайтиПоСинонимуИлиИмени(КэшКатегорий, Уточнение);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Категория) Тогда
				
				Результат.Категория = Категория;
				
				Если НРег(Строка(Категория)) <> НРег(Уточнение) Тогда
					
					Результат.Комментарий = Уточнение;
					
				КонецЕсли;
				
			Иначе
				
				Результат.Категория = КатегорияПрочие;
				Результат.Комментарий = Уточнение;
				
			КонецЕсли;
			
		Иначе
			
			Результат.Категория = КатегорияПрочие;
			
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Категория = НайтиВКэше(КэшКатегорий, Текст);
	
	Если Не ЗначениеЗаполнено(Категория) Тогда
		
		Категория = НайтиПоСинонимуИлиИмени(КэшКатегорий, Текст);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Категория) И ЗначениеЗаполнено(Уточнение) Тогда
		
		Категория = НайтиПоСинонимуИлиИмени(КэшКатегорий, Уточнение);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Категория) И ЗначениеЗаполнено(База) Тогда
		
		Категория = НайтиПоСинонимуИлиИмени(КэшКатегорий, База);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Категория) Тогда
		
		Категория = НайтиПоВхождению(КэшКатегорий, Текст);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Категория) Тогда
		
		Результат.Категория = Категория;
		
		Если ЗначениеЗаполнено(Уточнение) И НРег(Строка(Категория)) <> НРег(Уточнение) Тогда
			
			Результат.Комментарий = Уточнение;
			
		ИначеЕсли НРег(Строка(Категория)) <> НРег(Текст) Тогда
			
			Результат.Комментарий = Текст;
			
		КонецЕсли;
		
	Иначе
		
		Результат.Категория = КатегорияПрочие;
		Результат.Комментарий = Текст;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура РазобратьБазуИУточнение(Текст, База, Уточнение)
	
	База = Текст;
	Уточнение = "";
	
	ПозицияСкобки = СтрНайти(Текст, "(");
	
	Если ПозицияСкобки > 0 Тогда
		
		База = СокрЛП(Лев(Текст, ПозицияСкобки - 1));
		Уточнение = СокрЛП(Сред(Текст, ПозицияСкобки + 1));
		
		Если Прав(Уточнение, 1) = ")" Тогда
			
			Уточнение = СокрЛП(Лев(Уточнение, СтрДлина(Уточнение) - 1));
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// «Разное парковка» без скобок.
	Если СтрДлина(Текст) > 6 И НРег(Лев(Текст, 6)) = "разное" Тогда
		
		Хвост = СокрЛП(Сред(Текст, 7));
		
		Если ЗначениеЗаполнено(Хвост) Тогда
			
			База = "Разное";
			Уточнение = Хвост;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоБазаПрочее(База)
	
	Ключ = НРег(СокрЛП(База));
	
	Возврат Ключ = "разное"
		Или Ключ = "прочее"
		Или Ключ = "прочие"
		Или Ключ = "прочие расходы";
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиВПапкеПрочее(КэшКатегорий, Текст)
	
	Ключ = НРег(СокрЛП(Текст));
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		
		Возврат Справочники.КатегорииРасходов.ПустаяСсылка();
		
	КонецЕсли;
	
	Найденное = КэшКатегорий.ПоИмениВПрочем.Получить(Ключ);
	
	Если Найденное = Неопределено Тогда
		
		Возврат Справочники.КатегорииРасходов.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Найденное;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиПоСинонимуИлиИмени(КэшКатегорий, Текст)
	
	Ключ = НРег(СокрЛП(Текст));
	Категория = НайтиВКэше(КэшКатегорий, Ключ);
	
	Если ЗначениеЗаполнено(Категория) Тогда
		
		Возврат Категория;
		
	КонецЕсли;
	
	ИмяПоСинониму = КэшКатегорий.Синонимы.Получить(Ключ);
	
	Если ИмяПоСинониму = Неопределено Тогда
		
		Возврат Справочники.КатегорииРасходов.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат НайтиВКэше(КэшКатегорий, ИмяПоСинониму);
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиВКэше(КэшКатегорий, Текст)
	
	Ключ = НРег(СокрЛП(Текст));
	
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		
		Возврат Справочники.КатегорииРасходов.ПустаяСсылка();
		
	КонецЕсли;
	
	Найденное = КэшКатегорий.ПоИмени.Получить(Ключ);
	
	Если Найденное = Неопределено Тогда
		
		Возврат Справочники.КатегорииРасходов.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Найденное;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиПоВхождению(КэшКатегорий, Текст)
	
	КлючТекста = НРег(СокрЛП(Текст));
	ЛучшаяСсылка = Справочники.КатегорииРасходов.ПустаяСсылка();
	ЛучшаяДлина = 0;
	
	Для Каждого Элемент Из КэшКатегорий.Список Цикл
		
		Если СтрДлина(Элемент.Ключ) < 3 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрНайти(КлючТекста, Элемент.Ключ) = 0 Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если СтрДлина(Элемент.Ключ) > ЛучшаяДлина Тогда
			
			ЛучшаяДлина = СтрДлина(Элемент.Ключ);
			ЛучшаяСсылка = Элемент.Ссылка;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЛучшаяСсылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбрезатьКомментарий(Текст)
	
	Значение = СокрЛП(Текст);
	
	Если СтрДлина(Значение) > 150 Тогда
		
		Возврат Лев(Значение, 150);
		
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти
